Revit 2027 API
ParameterTypeId.TextStyleItalic Property
 "Italic"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TextStyleItalic { get; }
Public Shared ReadOnly Property TextStyleItalic As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TextStyleItalic {
	ForgeTypeId^ get ();
}
static member TextStyleItalic : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace